---
kind: enumMember
id: F:Autodesk.Revit.DB.FailureResolutionType.SetValue
enum: Autodesk.Revit.DB.FailureResolutionType
source: html/786e6422-f66d-5320-99f9-e530819e50a1.htm
---
# Autodesk.Revit.DB.FailureResolutionType.SetValue

Defines a resolution of a failure by setting an appropriate value in place of invalid value.